In [2]:
import pandas as pd
pd.__version__

'1.0.5'

In [5]:
loan_file_path = 'C:/Users/guicn/Documents/FEUP/5/1s/ECAC/loan_train.csv'
loan_data = pd.read_csv(loan_file_path, sep=";")
loan_data.describe()

,loan_id,account_id,date,amount,duration,payments,status
count,328.000000,328.000000,328.000000,328.000000,328.000000,328.000000,328.000000
mean,6205.658537,5982.085366,949989.125000,145308.621951,35.853659,4150.932927,0.719512
std,667.985675,3213.262492,9495.504646,105247.318098,16.734752,2193.620989,0.695541
min,4959.000000,2.000000,930705.000000,4980.000000,12.000000,319.000000,-1.000000
25%,5604.250000,3079.000000,940809.250000,68328.000000,24.000000,2368.750000,1.000000
50%,6227.500000,6032.000000,950565.500000,114804.000000,36.000000,3878.500000,1.000000
75%,6737.250000,8564.500000,960525.250000,198600.000000,48.000000,5907.750000,1.000000
max,7308.000000,11362.000000,961227.000000,538500.000000,60.000000,9689.000000,1.000000

In [6]:
y = loan_data.status

In [7]:
loan_features = ['amount']

In [8]:
X = loan_data[loan_features]

In [9]:
X.describe()

              amount
count     328.000000
mean   145308.621951
std    105247.318098
min      4980.000000
25%     68328.000000
50%    114804.000000
75%    198600.000000
max    538500.000000

In [10]:
X.head()

   amount
0   96396
1  165960
2  127080
3  105804
4  274740

In [11]:
from sklearn.tree import DecisionTreeRegressor

In [12]:
loan_model = DecisionTreeRegressor(random_state=1)

In [13]:
loan_model.fit(X, y)

DecisionTreeRegressor(random_state=1)

In [15]:
X.head()

   amount
0   96396
1  165960
2  127080
3  105804
4  274740

In [18]:
print(loan_data.head())
loan_model.predict(X.head())

   loan_id  account_id    date  amount  duration  payments  status
0     5314        1787  930705   96396        12      8033      -1
1     5316        1801  930711  165960        36      4610       1
2     6863        9188  930728  127080        60      2118       1
3     5325        1843  930803  105804        36      2939       1
4     7240       11013  930906  274740        60      4579       1

array([-1.,  1.,  1.,  1.,  1.])

In [33]:
under94 = loan_data[loan_data['date']<940000]
y = loan_data[loan_data['date']<940000].status
y.describe()

count    20.000000
mean      0.600000
std       0.820783
min      -1.000000
25%       1.000000
50%       1.000000
75%       1.000000
max       1.000000
Name: status, dtype: float64

In [24]:
under95 = loan_data[(loan_data['date']>= 940000) & (loan_data['date']<950000)]

In [25]:
under94.head()

   loan_id  account_id    date  amount  duration  payments  status
0     5314        1787  930705   96396        12      8033      -1
1     5316        1801  930711  165960        36      4610       1
2     6863        9188  930728  127080        60      2118       1
3     5325        1843  930803  105804        36      2939       1
4     7240       11013  930906  274740        60      4579       1

In [26]:
under95.head()

    loan_id  account_id    date  amount  duration  payments  status
20     4959           2  940105   80952        24      3373       1
21     6499        7401  940105   80952        24      3373       1
22     5479        2486  940110   24516        12      2043       1
23     5170        1071  940120  253200        60      4220       1
24     6721        8475  940121   21072        24       878       1

In [27]:
under96 = loan_data[(loan_data['date']>= 950000) & (loan_data['date']<960000)]

In [28]:
under97 = loan_data[(loan_data['date']>= 960000) & (loan_data['date']<970000)]

In [29]:
X = under94[loan_features]

In [30]:
loan_model = DecisionTreeRegressor(random_state=1)

In [34]:
loan_model.fit(X, y)

DecisionTreeRegressor(random_state=1)

In [45]:
print(loan_model.predict(under95[loan_features]))
print(loan_data[(loan_data['date']>= 940000) & (loan_data['date']<950000)].status)

[ 1.  1.  1.  1.  1.  1.  1.  1.  1. -1.  1. -1.  1.  1.  1.  1.  1. -1.
  1.  1. -1. -1.  1. -1.  1.  1.  1. -1. -1. -1.  1.  1.  1. -1.  1.  1.
  1.  1.  1.  1. -1.  1. -1.  1.  1.  1.  1.  1.  1.  1. -1.  1.  1.  1.
 -1.  1. -1.  1. -1.  1.  1. -1.  1. -1.  1.  1.  1.  1.  1.  1. -1.  1.
  1.  1. -1.  1. -1.  1.  1. -1.  1.  1. -1.  1.  1.  1.  1.  1.  1.  1.
 -1.  1. -1.  1. -1. -1.  1. -1. -1.  1.  1.]
20     1
21     1
22     1
23     1
24     1
      ..
116    1
117    1
118    1
119    1
120    1
Name: status, Length: 101, dtype: int64